results/2026-05-27/benchmark_safe_firebird_20260527_234614.txt
========================================
Sysbench Read/Safe Benchmark Suite
Driver: firebird
Tables: 4 x 10000 rows
Threads: 4, Time: 10s
Script start: Wed May 27 11:46:14 PM CEST 2026
========================================
Preparing tables...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...

Benchmarks start: Wed May 27 11:46:45 PM CEST 2026
========================================

--- oltp_point_select ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            117494
        write:                           0
        other:                           0
        total:                           117494
    transactions:                        117494 (11679.46 per sec.)
    queries:                             117494 (11679.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      11679.4611
    time elapsed:                        10.0599s
    total number of events:              117494

Latency (ms):
         min:                                    0.07
         avg:                                    0.34
         max:                                   22.86
         95th percentile:                        0.53
         sum:                                39914.08

Threads fairness:
    events (avg/stddev):           29373.5000/95.07
    execution time (avg/stddev):   9.9785/0.00


--- oltp_read_only ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            73738
        write:                           0
        other:                           10534
        total:                           84272
    transactions:                        5267   (524.15 per sec.)
    queries:                             84272  (8386.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      524.1502
    time elapsed:                        10.0486s
    total number of events:              5267

Latency (ms):
         min:                                    4.49
         avg:                                    7.58
         max:                                   78.32
         95th percentile:                       14.46
         sum:                                39921.86

Threads fairness:
    events (avg/stddev):           1316.7500/3.63
    execution time (avg/stddev):   9.9805/0.03


--- oltp_read_write ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            73948
        write:                           21121
        other:                           10562
        total:                           105631
    transactions:                        5280   (525.38 per sec.)
    queries:                             105631 (10510.72 per sec.)
    ignored errors:                      2      (0.20 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      525.3818
    time elapsed:                        10.0498s
    total number of events:              5280

Latency (ms):
         min:                                    5.27
         avg:                                    7.58
         max:                                   25.41
         95th percentile:                        9.56
         sum:                                40002.79

Threads fairness:
    events (avg/stddev):           1320.0000/10.79
    execution time (avg/stddev):   10.0007/0.00


--- oltp_update_index ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           663
        other:                           0
        total:                           663
    transactions:                        663    (65.71 per sec.)
    queries:                             663    (65.71 per sec.)
    ignored errors:                      1      (0.10 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      65.7059
    time elapsed:                        10.0904s
    total number of events:              663

Latency (ms):
         min:                                    0.12
         avg:                                   60.59
         max:                                10005.03
         95th percentile:                        0.45
         sum:                                40169.01

Threads fairness:
    events (avg/stddev):           165.7500/32.21
    execution time (avg/stddev):   10.0423/0.00


--- oltp_update_non_index ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           352
        other:                           0
        total:                           352
    transactions:                        352    (34.94 per sec.)
    queries:                             352    (34.94 per sec.)
    ignored errors:                      1      (0.10 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      34.9366
    time elapsed:                        10.0754s
    total number of events:              352

Latency (ms):
         min:                                    0.13
         avg:                                  113.93
         max:                                10017.45
         95th percentile:                        0.37
         sum:                                40102.93

Threads fairness:
    events (avg/stddev):           88.0000/21.99
    execution time (avg/stddev):   10.0257/0.00


========================================
Script start:     2026-05-27 23:46:14
Benchmarks start: 2026-05-27 23:46:45
Script end:       2026-05-27 23:47:36
Prep time:        31s
Benchmark time:   51s
Total time:       82s
Results saved to: benchmark_safe_firebird_20260527_234614.txt
========================================